---
kind: property
id: P:Autodesk.Revit.DB.DocumentPreviewSettings.IsValidObject
source: html/cab43c80-e705-b1a4-5b66-b60795c72d7a.htm
---
# Autodesk.Revit.DB.DocumentPreviewSettings.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.